wsdl/media2_service.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://www.onvif.org/ver20/media/wsdl" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://www.onvif.org/ver20/media/wsdl" name="Media2Service">
  <types>
    <xs:schema targetNamespace="http://www.onvif.org/ver20/media/wsdl">
      <xs:complexType name="RecordingSchedule">
        <xs:sequence>
          <xs:any minOccurs="0" maxOccurs="unbounded" processContents="lax" />
        </xs:sequence>
      </xs:complexType>
      <xs:complexType name="RecordingConfiguration">
        <xs:sequence>
          <xs:element name="Mode" type="xs:string" />
          <xs:element name="Schedule" type="tns:RecordingSchedule" minOccurs="0" />
        </xs:sequence>
      </xs:complexType>
      <xs:complexType name="ServiceCapabilities">
        <xs:sequence>
          <xs:any minOccurs="0" processContents="lax" />
        </xs:sequence>
        <xs:attribute name="SnapshotUri" type="xs:boolean" />
        <xs:attribute name="Rotation" type="xs:boolean" />
        <xs:attribute name="VideoSourceMode" type="xs:boolean" />
        <xs:attribute name="OSD" type="xs:boolean" />
        <xs:attribute name="TemporaryOSDText" type="xs:boolean" />
        <xs:attribute name="Mask" type="xs:boolean" />
        <xs:attribute name="SourceMask" type="xs:boolean" />
      </xs:complexType>
    </xs:schema>
  </types>

  <message name="GetServiceCapabilitiesRequest" />
  <message name="GetServiceCapabilitiesResponse">
    <part name="Capabilities" type="tns:ServiceCapabilities" />
  </message>

  <message name="GetRecordingConfigurationRequest" />
  <message name="GetRecordingConfigurationResponse">
    <part name="RecordingConfiguration" type="tns:RecordingConfiguration" />
  </message>

  <message name="SetRecordingConfigurationRequest">
    <part name="RecordingConfiguration" type="tns:RecordingConfiguration" />
  </message>
  <message name="SetRecordingConfigurationResponse">
    <part name="RecordingConfiguration" type="tns:RecordingConfiguration" />
  </message>

  <message name="SetRecordingModeRequest">
    <part name="Mode" type="xs:string" />
  </message>
  <message name="SetRecordingModeResponse">
    <part name="RecordingConfiguration" type="tns:RecordingConfiguration" />
    <part name="Mode" type="xs:string" />
  </message>

  <message name="SetRecordingScheduleRequest">
    <part name="Schedule" type="tns:RecordingSchedule" />
  </message>
  <message name="SetRecordingScheduleResponse">
    <part name="RecordingConfiguration" type="tns:RecordingConfiguration" />
    <part name="Schedule" type="tns:RecordingSchedule" />
  </message>

  <portType name="Media2PortType">
    <operation name="GetServiceCapabilities">
      <input message="tns:GetServiceCapabilitiesRequest" />
      <output message="tns:GetServiceCapabilitiesResponse" />
    </operation>
    <operation name="GetRecordingConfiguration">
      <input message="tns:GetRecordingConfigurationRequest" />
      <output message="tns:GetRecordingConfigurationResponse" />
    </operation>
    <operation name="SetRecordingConfiguration">
      <input message="tns:SetRecordingConfigurationRequest" />
      <output message="tns:SetRecordingConfigurationResponse" />
    </operation>
    <operation name="SetRecordingMode">
      <input message="tns:SetRecordingModeRequest" />
      <output message="tns:SetRecordingModeResponse" />
    </operation>
    <operation name="SetRecordingSchedule">
      <input message="tns:SetRecordingScheduleRequest" />
      <output message="tns:SetRecordingScheduleResponse" />
    </operation>
  </portType>

  <binding name="Media2Binding" type="tns:Media2PortType">
    <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http" />
    <operation name="GetServiceCapabilities">
      <soap:operation soapAction="http://www.onvif.org/ver20/media/wsdl/GetServiceCapabilities" />
      <input><soap:body use="literal" /></input>
      <output><soap:body use="literal" /></output>
    </operation>
    <operation name="GetRecordingConfiguration">
      <soap:operation soapAction="http://www.onvif.org/ver20/media/wsdl/GetRecordingConfiguration" />
      <input><soap:body use="literal" /></input>
      <output><soap:body use="literal" /></output>
    </operation>
    <operation name="SetRecordingConfiguration">
      <soap:operation soapAction="http://www.onvif.org/ver20/media/wsdl/SetRecordingConfiguration" />
      <input><soap:body use="literal" /></input>
      <output><soap:body use="literal" /></output>
    </operation>
    <operation name="SetRecordingMode">
      <soap:operation soapAction="http://www.onvif.org/ver20/media/wsdl/SetRecordingMode" />
      <input><soap:body use="literal" /></input>
      <output><soap:body use="literal" /></output>
    </operation>
    <operation name="SetRecordingSchedule">
      <soap:operation soapAction="http://www.onvif.org/ver20/media/wsdl/SetRecordingSchedule" />
      <input><soap:body use="literal" /></input>
      <output><soap:body use="literal" /></output>
    </operation>
  </binding>

  <service name="Media2Service">
    <port name="Media2" binding="tns:Media2Binding">
      <soap:address location="http://0.0.0.0:0/onvif/media2_service" />
    </port>
  </service>
</definitions>
