vapix/onvif-request/app/initial-info-request/getServicesCapabilities.xml

<!-- Endpoint: /vapix/services -->

<!-- Request: GetServicesCapabilities -->

<?xml version="1.0" encoding="UTF-8"?>
<Envelope xmlns="http://www.w3.org/2003/05/soap-envelope">
    <Header/>
    <Body >
        <GetServiceCapabilities xmlns="http://www.onvif.org/ver20/media/wsdl" />
    </Body>
</Envelope>

<!-- Response: GetServiceCapabilitiesResponse -->

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
    xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:c14n="http://www.w3.org/2001/10/xml-exc-c14n#"
    xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
    xmlns:ds="http://www.w3.org/2000/09/xmldsig#"
    xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
    xmlns:wsa5="http://www.w3.org/2005/08/addressing"
    xmlns:tt="http://www.onvif.org/ver10/schema"
    xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2"
    xmlns:tns1="http://www.onvif.org/ver10/topics"
    xmlns:tnsaxis="http://www.axis.com/2009/event/topics"
    xmlns:tev="http://www.onvif.org/ver10/events/wsdl"
    xmlns:tr2="http://www.onvif.org/ver20/media/wsdl"
    xmlns:axt="http://www.onvif.org/ver20/analytics"
    xmlns:ter="http://www.onvif.org/ver10/error">
    <SOAP-ENV:Header></SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <tr2:GetServiceCapabilitiesResponse>
            <tr2:Capabilities OSD="true" VideoSourceMode="true" Rotation="true" SnapshotUri="true">
                <tr2:ProfileCapabilities ConfigurationsSupported="Metadata VideoSource VideoEncoder Analytics" MaximumNumberOfProfiles="32"></tr2:ProfileCapabilities>
                <tr2:StreamingCapabilities RTSPWebSocketUri="ws:/onvif/rtsp-over-websocket" RTP_RTSP_TCP="true" RTPMulticast="true" RTSPStreaming="true"></tr2:StreamingCapabilities>
            </tr2:Capabilities>
        </tr2:GetServiceCapabilitiesResponse>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>